uhnp/src/InformationRegisters/НастройкаПодтвержденияЗакупки/НастройкаПодтвержденияЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПодтвержденияЗакупки</name>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.КатегорииЗакупок</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкаПодтвержденияЗакупки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	ОповещениеФормыПодбора = Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбора", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкаПодтвержденияЗакупки.Форма.ФормаПодбора",,,,,,
						ОповещениеФормыПодбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбора(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДанные(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЦФО", 			ТекущиеДанные.ЦФО);
	СтруктураПараметров.Вставить("Номенклатура", 	ТекущиеДанные.Номенклатура);
	ОткрытьФорму("РегистрСведений.НастройкаПодтвержденияЗакупки.Форма.ФормаСвязанныеДанные",СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеКатегории(Команда)                           

	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);

	ОткрытьФорму("Отчет.ОтчетПоТоварнымКатегориям.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
